#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ["Отец, Мать, Я, Сестра"]


# список списков приблизителного роста членов вашей семьи
my_family_height = [["Отец", 186],
["Мать",164],
["Я", 188],
["Сестра", 180]]
# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print("Рост отца - " + str(my_family_height[0][1]) + " см")

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
my_family_height = [["Отец", 186],
["Мать",164],
["Я", 188],
["Сестра", 180]]